Revit 2026 API

# ViewCreateViewTemplate Method

---

Creates a new view template instance from this view instance.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public View CreateViewTemplate()
```
```vb
Public Function CreateViewTemplate As View
```
```cpp
public:
View^ CreateViewTemplate()
```
```fsharp
member CreateViewTemplate : unit -> View
```

#### Return Value

View New view template instance

| Exception | Condition |
| --- | --- |
| InvalidOperationException | The view is not valid for view template creation. |

#### Reference

View Class

Autodesk.Revit.DB Namespace